Repository: KDE/kdeclarative
Catalog: po/*/kdeclarative6.po
Languages: cs, lt

# @info:whatsthis for a button
source: Color button
lt: Spalvos mygtukas

# @info:whatsthis for a button of current color code %1
source: Current color is %1. This button will open a color chooser dialog.
lt: Dabartinė spalva yra %1. Šis mygtukas atvers spalvos parinkiklio dialogą.

# @info:whatsthis for a button of current color code %1
source: Current color is %1.
cs: Aktuální barva je %1.
lt: Dabartinė spalva yra %1.

# What the user inputs now will be taken as the new shortcut
source: Input
cs: Vstup
lt: Įvestis

# No shortcut defined
source: None
cs: Žádná
lt: Nėra

source: Click on the button, then enter the shortcut like you would in the program. Example for Ctrl+A: hold the Ctrl key and press A.
cs: Klikněte na tlačítko a poté zadejte zkratku, kterou si přejete v programu. Příklad pro Ctrl+A: držte klávesu Ctrl a stiskněte A.
lt: Spustelėkite ant mygtuko, tada paspauskite spartųjį klavišą taip, kaip spaustumėte jį programoje. Pavyzdžiui, kombinacijai Vald+A: laikykite nuspaustą Vald klavišą ir paspauskite A.

# @info:tooltip
source: Clear Key Sequence
cs: Vymazat posloupnost kláves
lt: Išvalyti klavišų seką

# @info:tooltip
source: Cancel Key Sequence Recording
lt: Atsisakyti klavišų sekos įrašymą

source: Reserved Shortcut
cs: Rezervovaná klávesová zkratka
lt: Rezervuotas spartusis klavišas

source: The F12 key is reserved on Windows, so cannot be used for a global shortcut. Please choose another one.
cs: Klávesa F12 je na Windows rezervována a nelze ji tedy použít jako globální. Vyberte prosím jinou.
lt: F12 klavišas yra rezervuotas „Windows“ sistemoje, todėl negali būti naudojamas visuotiniems spartiesiems klavišams. Pasirinkite kitą.

source: Global Shortcut Shadowing
lt: Visuotinio sparčiojo klavišo uždengimas

source: The '%1' key combination is shadowed by following global actions:
lt: Klavišų kombinaciją „%1“ uždengia šie visuotiniai veiksmai:

source: Action '%1' in context '%2'
cs: Činnost '%1' v kontextu '%2'
lt: Veiksmas „%1“, esantis „%2“ kontekste

source: The '%1' key combination shadows following global actions:
lt: Klavišų kombinacija „%1“ uždengia šiuos visuotinius veiksmus:

# @dialog:title
source: Found Conflict
cs: Nalezen konflikt
lt: Rastas konfliktas

source: Shortcut '%1' is already assigned to action '%2' of %3. Do you want to reassign it?
cs: Zkratka '%1' je již přiřazena činnosti '%2' of %3. Chcete ji přeřadit?
lt: Spartusis klavišas „%1“ jau yra priskirtas veiksmui „%2“, kuris priklauso %3. Ar norite priskirti jį iš naujo?

source: Shortcut '%1' is already assigned to the following actions:
cs: Zkratka '%1' už je přiřazena pro následující činnosti:
lt: Spartusis klavišas „%1“ jau yra priskirtas šiems veiksmams:

source: Action '%1' of %2
cs: Činnost '%1' v %2
lt: Veiksmas „%1“, kuris priklauso %2

source: Do you want to reassign it?
cs: Přejete si ji přeřadit?
lt: Ar norite priskirti jį iš naujo?

source: Conflict with Standard Application Shortcut
cs: Konflikt se standardní zkratkou aplikace
lt: Konfliktas su programos standartiniu sparčiuoju klavišu

source: The '%1' key combination is also used for the standard action "%2" that some applications use. Do you really want to use it as a global shortcut as well?
cs: Klávesová kombinace '%1' již byla přiřazena standardní činnosti "%2", kterou mnoho aplikací využívá. Opravdu si ji přejete použít jako globální klávesovou zkratku?
lt: Klavišų kombinacija „%1“ jau priskirta standartiniam veiksmui „%2“, kurį naudoja kai kurios programos. Ar tikrai norite ją naudoti ir kaip visuotinę sparčiųjų klavišų kombinaciją?
