Repository: KDE/kdeclarative
Catalog: po/*/kdeclarative5.po
Languages: ast, de, hy, ru

# NAME OF TRANSLATORS
source: Your names
ast: Softastur
de: Thomas Reitelbach, Stephan Johach, Thomas Diehl
hy: Դավիթ Նիկողոսյան
ru: Григорий Мохин,Николай Шафоростов,Андрей Черепанов,Леонид Кантер,Альберт Валиев

# EMAIL OF TRANSLATORS
source: Your emails
ast: alministradores@softastur.org
de: tr@erdfunkstelle.de, hunsum@gmx.de, thd@kde.org
hy: nikdavnik@mail.ru
ru: mok@kde.ru,shaforostoff@kde.ru,skull@kde.ru,leon@asplinux.ru,darkstar@altlinux.ru

source: KPackage QML application shell
ast: Shell d'aplicaciones QML de KPackage
de: KPackage-QML-Anwendungs-Shell
ru: Оболочка для запуска приложений на KPackage QML

source: The unique name of the application (mandatory)
ast: El nome únicu de l'aplicación (obligatorio)
de: Der eindeutige Name der Anwendung (erforderlich)
ru: Уникальное имя приложения (обязательно)

# @action:button
source: Show Contextual Help
de: Kontexthilfe anzeigen
ru: Показать контекстную справку

source: No items found
de: Keine Elemente gefunden

# What the user inputs now will be taken as the new shortcut
source: Input
ast: Entrada
de: Eingabe
hy: Հիմա
ru: Сейчас

# No shortcut defined
source: None
ast: Nada
de: Keiner
hy: Ընտրված չէ
ru: Не определена

source: Click on the button, then enter the shortcut like you would in the program. Example for Ctrl+A: hold the Ctrl key and press A.
ast: Primi nel menú, depués introduz l'atayu como te prestaría nel programa. Exemplu pa Ctrl+A: ten primida la tecla Ctrl y dempués calca la A
de: Klicken Sie auf den Knopf und drücken Sie dann die Tasten für den Kurzbefehl auf der Tastatur. Beispielsweise für Strg+A: Halten Sie die Strg-Taste gedrückt und drücken Sie dann „A“.
ru: Нажмите на кнопке и введите комбинацию клавиш. Например, для комбинации клавиш Ctrl+A зажмите клавишу Ctrl и нажмите A.

source: Reserved Shortcut
ast: Atayu acutáu
de: Reservierter Kurzbefehl
hy: Պահեստավորված կոճակների համադրություն
ru: Зарезервированная комбинация клавиш

source: The F12 key is reserved on Windows, so cannot be used for a global shortcut. Please choose another one.
ast: La tecla F12 ta acutada en WIndows, asina que nun pue usase pa un atayu global. Escueyi otra, por favor.
de: Die Taste „F12“ ist unter Windows reserviert, kann also nicht als globaler Kurzbefehl verwendet werden. Bitte wählen Sie eine andere Taste.
hy: Windows F12 կոճակը պաշտպանված է, այդ պատճառով այն չի կարելի օգտագործել կոճակների գլոբալ կոմբինացիաներում: Ընտրեք կոճակների այլ կոմբինացիա:
ru: В Windows клавиша F12 зарезервирована, поэтому её нельзя использовать в глобальных комбинациях клавиш. Выберите другую комбинацию клавиш.

source: Conflict with Standard Application Shortcut
ast: Conlfictu col atayu estándar d'aplicación
de: Konflikt mit Standard-Kurzbefehl des Programms
hy: Կոնֆլիկտ ծրագրի ստանդարտ կոճակի հետ
ru: Конфликт со стандартной клавишей приложения

source: The '%1' key combination is also used for the standard action "%2" that some applications use. Do you really want to use it as a global shortcut as well?
ast: La combinación de tecles «%1» tamién s'usa pa l'aición estándar «%2» que delles aplicaciones usen. ¿De xuru que quies usala tamién como atayu global?
de: Die Tastenkombination „%1“ ist bereits der Standard-Aktion „%2“ zugeordnet, die von einigen Anwendungen benutzt wird. Möchten Sie sie wirklich als globales Tastenkürzel verwenden?
hy: %1 ստեղների կոմբինացիան արդեն կապված է «%2» ստանդարտ գործողության հետ, որն օգտագործվում է մի շարք ծրագրերում։ Ուզու՞մ եք օգտագործել այս կոմբինացիան որպես գլոբալ։
ru: Комбинация клавиш %1 уже связана со стандартным действием «%2», используемым во многих программах. Вы действительно хотите использовать эту комбинацию как глобальную?

source: Reassign
ast: Reasignar
de: Neu zuordnen
hy: Կապել նորի հետ
ru: Связать с новым

source: Invalid KPackage '%1'
de: Ungültiges KPackage „%1“
ru: Неверный пакет KPackage «%1»

source: No QML file provided
de: Keine QML-Datei angegeben
ru: Отсутствует файл QML

source: The key you just pressed is not supported by Qt.
ast: La tecla que tas acabante primi nun la sofita Qt.
hy: Սեղմված կոճակը չի համապատասխանում Qt հետ։

source: Unsupported Key
ast: Tecla ensin sofitu
hy: Կոճակը չի համապատասխանում
